
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр кплРаспределениеСуммПоПроектам Приход
	Движения.кплРаспределениеСуммПоПроектам.Записывать = Истина;
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		Движение = Движения.кплРаспределениеСуммПоПроектам.Добавить();
		Движение.Период = Дата;
		Движение.УчастникСделки = УчастникСделки;
		Движение.Проект = ТекСтрокаПроекты.Проект;
		Движение.Сумма = ТекСтрокаПроекты.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
