
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Сделки 
	Движения.Сделки.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыИУслуги Из ТоварыИУслуги Цикл
		Движение = Движения.Сделки.Добавить();
		Движение.Период = Дата;
		Движение.УчастникСделки = Покупатель;
		Движение.Сумма = ТекСтрокаТоварыИУслуги.Сумма;
		Движение.СуммаВОбщественныйФонд = ТекСтрокаТоварыИУслуги.СуммаВОбщественныйФонд;
		Движение.Номенклатура = ТекСтрокаТоварыИУслуги.Номенклатура;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
