
&НаСервере
Процедура РаспределитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Проекты.Ответственный КАК Ответственный,
	|	Проекты.Ссылка КАК Проект,
	|	0 КАК Сумма
	|ИЗ
	|	Справочник.Проекты КАК Проекты";
	
	//Запрос.УстановитьПараметр("", );
	
	Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	
	тзПроектов.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры
