
&НаСервере
Процедура РаспределитьНаСервере()
	
	Если тзПроектов.Итог("Сумма") = 0 тогда
		Возврат;
	КонецЕсли;
	
	ДокументРаспределения = Документы.кплРаспределениеСуммПоПроектам.СоздатьДокумент();
	ДокументРаспределения.Дата = ТекущаяДата();
	ДокументРаспределения.УчастникСделки = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	
	Для Каждого СтрокаРешения Из тзПроектов Цикл
		Если СтрокаРешения.Сумма > 0 Тогда
			НоваяСтрока = ДокументРаспределения.Проекты.Добавить();
			НоваяСтрока.Проект	 = СтрокаРешения.Проект;
			НоваяСтрока.Сумма	 = СтрокаРешения.Сумма;
		КонецЕсли;
	КонецЦикла;
	//УстановитьПривилегированныйРежим(Истина);
	Попытка
		ДокументРаспределения.Записать(РежимЗаписиДокумента.Запись);
		ДокументРаспределения.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Проекты.Ответственный КАК Ответственный,
	|	Проекты.Ссылка КАК Проект,
	|	0 КАК Сумма
	|ИЗ
	|	Справочник.Проекты КАК Проекты";
	
	//Запрос.УстановитьПараметр("", );
	
	Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	
	тзПроектов.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры
